<?php
require '../com/db2.php';

$members = '北京绿源友益苗圃,13683150680;北京森鑫淼果林医院,69323335;北京市斜巴地庭园苗圃,13683512702;北京昊天坤园林绿化服务中心,13501053626;北京岚山苗圃,15601369698;北京神农亚博苗木有限公司,;北京石尚苗木种植中心,13716881990;北京北林林业发展有限公司,13716029609;北京龙乡苗木种植中心,15639586918;北京建国伟业生态种植中心,13701318851;北京鑫宇绿洲园林绿化工程公司,15901397815;北京燕农农林科技发展有限公司,18510665698;北京富源苗木有限公司,13911893867;北京市城关绿景苗木种植中心,13520766568;北京朗森园林绿化工程有限公司,15010880902,;北京市房山玄辕寺林场,13810414372;北京市长沟振成苗圃园,13521232742;北京昊瀚绿洲园林绿化工程有限公司,;北京红雷苗木种植中心,15910687212;北京金元佳禾园林绿化工程有限公司,13716667358;北京康继合苗木种植中心,;北京玄辕英源林业发展有限公司,13810414372;北京弘源源苗圃,13671395596;北京水岸花田苗木种植基地,13311235598;北京景尚春苗木种植中心,15699888792;北京周口店马云生苗圃场,13621238485;北京周口店三木苗圃场,18910751801;北京辛庄隆盛兴果园,;北京拓林达园林绿化工程有限公司,;北京建承嘉益商贸有限公司,61387198/13522904940;北京大石窝永兴苗圃场,61321914;北京大石窝永兴苗圃场,13718312763;北京大石窝生辉种植园,18519584158/61322310;北京长宝伟业苗木有限公司,13240304964;北京王立顺苗圃种植中心,13651340496;北京廷辉顺发种植园,17710252449;北京石窝永久农业发展有限公司,13718221808;北京金汇圃种植园,13716176531;北京大石窝少为种植有限公司,61387692/13693298187;北京惠缘种植有限公司,13552296085;北京继伟兴业园林绿化有限公司,13501007338;北京窦店绿园种植中心,80318603/13511053972;北京森茂种植有限公司,13321186795;北京金樱桃农林科技发展有限公司,69397851/13051155185;北京环美绿源苗木有限公司,80319988/13910700497;北京翠林花海农产品专业合作社,13716637427;北京绿缘昊杰种植中心,13718836006;北京窦店文彧菱竹种植中心,80319086/13901286477;北京国电中兴农业发展有限公司,13811872680;北京金地天润农业科技有限公司,15010211785;北京星河绿源园林苗木有限公司,15001034518;北京星河绿源园林苗木有限公司,13552303156;北京昊森晟达种植有限公司,13511001101;北京康乐种植基地,13801092740;北京市交道绿海苗圃场,18701215983;北京市交道绿海苗圃场,18701215983;北京清源林业发展有限公司,13811887971;北京绿兴民农产品专业合作社,13331004416;北京梅氏园林绿化有限公司,13911909987;北京华源盛景园林绿化工程有限公司,13910311018;北京亿万年花卉有限公司,18601215218;北京龙华园绿化工程有限公司,18610839384;北京绿禾兴隆农业发展有限公司,13552008199;北京峻伟种植有限公司,13910851262;北京付志勇苗圃,61311816/13681198115;北京千业苗圃,61316972/18910491606;北京盛圃成杏李专业合作社,13501072675;北京韩村河凯林林苗木种植中心,61311096/13716122864;北京市韩村河天宝花木种植园,61326559/13716375021;北京普菊花卉种植中心,80388423/13381137125;北京市韩村河忠德苗圃场,61315033/13261005077;北京金冠果业有限公司,13681204045;北京圣水绿洲农林生态园,13661017088;北京市韩村河新兴农场,18701176654;北京市革嘉劳务服务中心,13521004513;北京艺柏苗木种植中心,13301258322;北京市房山东营农场,13716786681;北京华贺苗木种植有限公司,13161276800;北京昊欣远景科技有限公司农业发展分公司,13021178828;北京陈仕伟业科技有限责任公司,13021178828;北京宝玲苗木种植中心,13716815869;北京新红兴旺苗木种植中心,13701061397;北京市昊一大林业开发公司,13911612755;北京智鸿园林绿化工程有限公司,13911771307;北京全睿德物业管理有限责任公司,13910261027/13466365884;九谷森林（北京）绿化工程有限公司,13811425866;北京茂林绿洲苗木种植有限公司,13811425288;北京市北章建华苗圃场,80301839/13691586551;北京市琉璃河洪波苗圃场,13521163221;北京市琉璃河争春园林绿化服务中心,80399902/13520951525;北京市普生栎园金银花种植专业合作社,13910135408;北京中林华瑞林业发展有限公司,15811325474;北京静杰种植中心,13263367007;北京绿锦苑园林绿化有限公司,13911731281;北京香江种植专业合作社,13910290729;北京林源花苑苗木种植中心,13621133167;北京天唯苗木种植园 ,13911731281;北京金方富宏园林绿化工程有限公司,13910208024;北京张坊林场,13716667502;北京龙贵绿化工程有限公司,17501004610;北京市长阳果园有限公司,60352489/13901050531;北京怡顺达园林绿化工程有限公司,13552881949;北京伟望科沐种植有限公司,13120078239;北京市鑫绿园苗圃种植场,13146515415;北京石楼新绿苗木种植中心,13511023999;北京汇琦种植中心,13911041113;北京城关五木苗木种植中心,13511016842;北京紫竹苗木有限公司,13381133122;北京长周苗圃,13552019311;北京文茵风景园林绿化有限公司第一分公司,15901203398;北京中山绿海源种植专业合作社,15110056540;北京绿野彩枫苗木种植中心,13716131518;北京北河振军实叶石材商店,15011251038;北京芳香谷农业观光园有限公司,;北京绿绮花卉专业合作社,13801206789;北京昱民康畜牧科技发展有限公司,13811428793;北京轩城景逸园林绿化有限公司,13716645113;北京尚美苗木有限公司,13834719307;北京京林园林绿化工程有限公司,;长白山森工鸿美苗木有限公司北京分公司,13311067532;北京良乡天意合佳苗木种植有限公司,13911754878;北京市新发昌盛花木种植中心,15313515753;北京泛雅博艺苗木种植中心,;北京鸿祥园林绿化公司,15010909308;北京市青龙湖大苑村苗圃,13910123390;北京青龙湖艳海苗圃场,13691551036;北京鑫汇天正园艺有限公司,;北京佳苑益民养殖中心,15901137574;北京溢彩茂源种植有限公司,;北京山水文园园林绿化有限公司,18801392603;北京嘉程苗木种植中心,;北京源禄枫种植中心,13911517130;北京美景绿都园林绿化工程有限公司,13121115370;北京美景绿都园林绿化工程有限公司,13810049496;北京紫雾种植有限公司,13910962220;北京紫雾种植有限公司,15901033137;北京茂林盛园种植基地,;北京横富园林绿化有限责任公司,13691551033;北京隆达世纪商贸有限责任公司,;北京金顺绿都生态种植有限公司,13901372647;北京德泓霆消防器材销售有限公司,;北京劲松种植有限公司,15910718587;北京明夺旺苗圃种植基地,13910803534;北京盛世旺通园林绿化有限公司,;北京宜悦农业发展有限公司,18701629166;北京复兴良种繁育中心,89319403;北京市南梨园园林绿化有限公司,89319403;北京军欣园林绿化工程有限公司,15811193224;北京绿林盛源园林绿化工程有限公司,13521093450;北京碧源兴物资有限公司,13426305267;北京郁都种植中心,18610287555;北京市绿视野园林种植中心,17301041124;北京碧水源生态环境科技有限公司,18701601590;北京北国绿园林绿化工程有限公司,13601118332;北京祺祥永业园林工程有限公司,13601201114';

$members = explode(';', $members);


$db = new db();

// $trees_out = array();
$user_tree = '';
$user_no = '';

foreach ($members as $key => $member) {
	$member = explode(',', $member);
	$phones = explode('/', $member[1]);
	$where_photos = "";

	foreach ($phones as $p => $phone) {
		$where_photos .= "phone='".$phone."' or ";
		if (strlen($phone)==8) {
			$where_photos .= "phone='010".$phone."' or ";
			$where_photos .= "phone='010-".$phone."' or ";
		}
	}

	$user = $db->query("select userid,shopid from user where ". $where_photos ."name='".$member[0]."'");
    
    // echo $user[0]['userid'].'<br>';
	if ($user) {
		$user = $user[0];

		$count = $db->query('select count(*) total from tree where shopid='.$user['shopid']);
		$user_tree .= $member[0].','.$member[1].','.$count[0]['total']."<br>";

		// $db->exec("update user set state=1020 where userid=".$user['userid']);

		// $file = httpGet('http://cnzhaoshu.com/excel.shop.php?isMine=1&shopid='.$user['shopid']);
		// file_put_contents("./lmzm/".$member[0].".xls", $file);
		// 苗木
		// $trees = $db->query("select name ")
	} else {
		$user_no .= $member[0].','.$member[1]."<br>";		
	}

}

unset($db);

echo $user_tree.'<br><br>';
echo $user_no.'<br><br>';


 function httpGet($url) {
    $curl = curl_init();
    curl_setopt($curl, CURLOPT_RETURNTRANSFER, true);
    curl_setopt($curl, CURLOPT_TIMEOUT, 500);
    curl_setopt($curl, CURLOPT_SSL_VERIFYPEER, false);
    curl_setopt($curl, CURLOPT_SSL_VERIFYHOST, false);
    curl_setopt($curl, CURLOPT_URL, $url);

    $res = curl_exec($curl);
    curl_close($curl);

    return $res;
  }


